// preloader trigger
$(".form button").click(function(e) {
        e.preventDefault();
        $(".form button").css("color", "transparent");
        $(".preloader").css("visibility", "visible");
    })
    // cities select
var cities = ["Авдеевка", "Акимовка", "Александрия", "Александровка", "Александровка", "Алупка", "Алушта", "Алчевск", "Амвросиевка", "Антрацит", "Апостолово", "Арбузинка", "Армянск", "Артемовск", "Арциз", "Ахтырка", "Балаклея", "Балта", "Бар", "Барановка", "Барвенково", "Барышевка", "Бахмач", "Бахчисарай", "Баштанка", "Белая Церковь", "Белгород-Днестровский", "Беловодск", "Белогорск", "Белогорье", "Белозерка", "Белополье", "Беляевка", "Бердичев", "Бердянск", "Берегово", "Бережаны", "Березанка", "Березино", "Березовка", "Берислав", "Бершадь", "Близнюки", "Бобринец", "Бобровица", "Богодухов", "Богуслав", "Болград", "Болехов", "Борзна", "Борислав", "Борисполь", "Боровая", "Бородянка", "Борщев", "Боярка", "Бровары", "Броды", "Брусилов", "Брянка", "Бузуков", "Бурштын", "Бурынь", "Буск", "Бучач", "Валки", "Варва", "Васильевка", "Васильков", "Васильковка", "Великая Белозерка", "Великая Новоселка", "Верхнеднепровск", "Верхов", "Верховина", "Веселиново", "Веселое", "Вижница", "Винница", "Виноградов", "Виньковцы", "Вишневое", "Владимир-Волынский", "Владимирец", "Вознесенск", "Волноваха", "Воловец", "Володарка", "Володарское", "Волочиск", "Волчанск", "Вольногорск", "Вольнянск", "Врадиевка", "Высокополье", "Вышгород", "Гадяч", "Гайворон", "Гайсин", "Галич", "Гаспра", "Геническ", "Герца", "Глеваха", "Глобино", "Глухов", "Глыбокая", "Голая Пристань", "Голованевск", "Горловка", "Горностаевка", "Городенка", "Городище", "Городня", "Городок", "Горохов", "Гоща", "Гребенка", "Гуляйполе", "Гурзуф", "Гусятин", "Двуречная", "Дебальцево", "Демидовка", "Деражня", "Дергачи", "Джанкой", "Дзержинск", "Диканька", "Днепродзержинск", "Днепропетровск", "Днепрорудное", "Доброполье", "Добрянка", "Докучаевск", "Долина", "Долинская", "Доманевка", "Донецк", "Драбов", "Дрогобыч", "Дружковка", "Дубно", "Дубровица", "Дунаевцы", "Евпатория", "Еланец", "Емильчино", "Енакиево", "Жашков", "Желтые Воды", "Жидачев", "Житомир", "Жмеринка", "Жолква", "Залещики", "Запорожье", "Заречное", "Заставна", "Зачепиловка", "Збараж", "Зборов", "Звенигородка", "Згуровка", "Здолбунов", "Зеньков", "Змиев", "Знаменка", "Золотоноша", "Золочев", "Ивано-Франковск", "Ивановка", "Иванычи", "Измаил", "Изюм", "Изяслав", "Илларионово", "Ильинцы", "Ильичевск", "Ирпень", "Иршава", "Ичня", "Кагарлык", "Казанка", "Казатин", "Каланчак", "Калиновка", "Калуш", "Каменец-Подольский", "Каменка", "Каменка-Бугская", "Каменка-Днепровская", "Камень-Каширский", "Канев", "Карловка", "Катеринополь", "Каховка", "Кегичевка", "Кельменцы", "Керчь", "Киверцы", "Киев", "Килия", "Кировоград", "Кировск", "Кировское", "Кицмань", "Кобеляки", "Ковель", "Кодыма", "Козелец", "Козельщина", "Козова", "Козятин", "Коломак", "Коломыя", "Компанеевка", "Комсомольск", "Конотоп", "Константиновка", "Кореиз", "Корец", "Короп", "Коростень", "Коростышев", "Корсунь-Шевченковский", "Корюковка", "Косов", "Костополь", "Котельва", "Котовск", "Краматорск", "Красилов", "Красноармейск", "Красноград", "Краснодон", "Краснокутск", "Красноперекопск", "Краснополье", "Красные Окны", "Красный Лиман", "Красный Луч", "Кременчуг", "Кривой Рог", "Куйбышево", "Кулиничи", "Купянск", "Ладыжин", "Лисичанск", "Лозовая", "Лопатин", "Лохвица", "Лубны", "Луганск", "Луцк", "Львов", "Люботин", "Макеевка", "Мангуш", "Марганец", "Мариуполь", "Марьинка", "Мелитополь", "Мена", "Мерефа", "Миргород", "Михайловка", "Млинов", "Могилев-Подольский", "Молодецкое", "Монастыриска", "Монастырище", "Моршин", "Мостиска", "Мукачево", "Мурованые Куриловцы", "Народичи", "Недригайлов", "Нежин", "Немиров", "Нетишин", "Нижние Серогозы", "Николаев", "Никополь", "Новая Каховка", "Новая Одесса", "Новая Ушица", "Новгород-Северский", "Новгородка", "Новоазовск", "Новоайдар", "Новоархангельск", "Нововолынск", "Нововоронцовка", "Новоград-Волынский", "Новоднестровск", "Новомиргород", "Новомосковск", "Новопсков", "Новоселица", "Новотроицкое", "Новоукраинка", "Новояворовск", "Новые Санжары", "Новый Буг", "Носовка", "Обухов", "Овидиополь", "Овруч", "Одесса", "Онуфриевка", "Оратов", "Орджоникидзе", "Орехов", "Оржица", "Острог", "Очаков", "Павлоград", "Первомайск", "Первомайский", "Первомайское", "Перевальск", "Перемышляны", "Перечин", "Переяслав-Хмельницкий", "Першотравенск", "Петрово", "Петропавловка", "Печенеги", "Пирятин", "Погребище", "Подволочиск", "Подгайцы", "Полесское", "Пологи", "Полонное", "Полтава", "Попасная", "Попельня", "Приазовское", "Прилуки", "Приморск", "Пустомыты", "Путивль", "Путила", "Пятихатки", "Радехов", "Радомышль", "Радывылив", "Раздельная", "Раздольное", "Ракитное", "Ратнов", "Рахов", "Репки", "Решетиловка", "Ровеньки", "Ровно", "Рогатин", "Рожище", "Рожнятов", "Розовка", "Романов", "Ромны", "Рубежное", "Ружин", "Саврань", "Садовое", "Саки", "Самбор", "Сарата", "Сарны", "Сахновщина", "Свалява", "Сватово", "Свердловск", "Светловодск", "Севастополь", "Северодонецк", "Селидово", "Семеновка", "Семеновка", "Середина-Буда", "Симферополь", "Синельниково", "Скадовск", "Сквира", "Сколе", "Славута", "Славутич Славяносербск", "Славянск", "Смела", "Снежное", "Снигиревка", "Снятин", "Сокаль", "Сокиряны", "Соленое", "Сосница", "Сосновка", "Софиевка", "Ставище", "Старая Выжевка", "Старая Синява", "Старобельск", "Старобешево", "Староконстантинов", "Старый", "Самбор", "Стаханов", "Сторожинец", "Стрый", "Судак", "Сумы", "Счастье", "Талалаевка", "Тальное", "Тараща", "Тарутино", "Татарбунары", "Тельманово", "Теофиполь", "Теплик", "Теребовля", "Терновка", "Тернополь", "Тетиев", "Тлумач", "Токмак", "Томаковка", "Томашполь", "Торез", "Троицкое", "Тростянец", "Трускавец", "Тульчин", "Турийск", "Турка", "Тячев", "Ужгород", "Украинка", "Ульяновка", "Умань", "Устиновка", "Фастов", "Феодосия", "Фрунзовка", "Харцызск", "Харьков", "Херсон", "Хмельник", "Хмельницкий", "Хорол", "Хотин", "Христиновка", "Хуст", "Царичанка", "Цюрупинск", "Чаплинка", "Чемеровцы", "Червоноармейск", "Червоноград", "Черкассы", "Черневцы", "Чернигов", "Черниговка", "Черновцы", "Черногородка", "Черняхов", "Чортков", "Чугуев", "Чутово", "Шаргород", "Шахтерск", "Шацк", "Шепетовка", "Широкое", "Ширяево", "Шишаки", "Шостка", "Шпола", "Шумск", "Щорс", "Энергодар", "Южноукраинск", "Южный", "Яворов", "Яготин", "Ялта", "Ямполь", "Яремча", "Ярмолинцы", "Ясиноватая"]

function auto_layout_keyboard(str) {
    replacer = {
        "q": "й",
        "w": "ц",
        "e": "у",
        "r": "к",
        "t": "е",
        "y": "н",
        "u": "г",
        "i": "ш",
        "o": "щ",
        "p": "з",
        "[": "х",
        "]": "ъ",
        "a": "ф",
        "s": "ы",
        "d": "в",
        "f": "а",
        "g": "п",
        "h": "р",
        "j": "о",
        "k": "л",
        "l": "д",
        ";": "ж",
        "'": "э",
        "z": "я",
        "x": "ч",
        "c": "с",
        "v": "м",
        "b": "и",
        "n": "т",
        "m": "ь",
        ",": "б",
        ".": "ю",
        "/": "."
    };
    return str.replace(/[A-z/,.;\'\]\[]/g, function(x) {
        return x == x.toLowerCase() ? replacer[x] : replacer[x.toLowerCase()].toUpperCase();
    });
}

$(".city").on("keyup", function() {
    $(".cities").css("display", "block");
    var inputValue = $(".city").val().toLowerCase();
    var searchQuery = auto_layout_keyboard(inputValue);
    var arr = cities;
    var citiesList = [];
    for (var i = 0; i < arr.length; i++) {
        arr[i].toLowerCase().indexOf(searchQuery) !== -1;
        if (arr[i].toLowerCase().indexOf(searchQuery) !== -1) {
            citiesList.push(arr[i]);
        }
    }
    $(".cities").empty();
    for (var i = 0; i < citiesList.length; i++) {
        $(".cities").append("<li>" + citiesList[i] + "</li>");
    }
});

$("body").on("click", ".cities li", function() {
    $(".city").val($(this).text());
    $(".cities").css("display", "none");
})
$("body").click(function() {
        $(".cities").css("display", "none");
    })
    // job select
var jobs = ["Адвокат", "Генеральный секретарь", "Делопроизводитель", "Детектив", "Дипломат", "Конвоир", "Милиционер", "Министр", "Нотариус", "Охранник", "Полицейский", "Правовед", "Прокурор", "Следователь", "Судебный пристав", "Судья", "Телохранитель", "Тюремный надзиратель", "Юрист", "Верстальщик", "Выпускающий редактор", "Издатель", "Корректор", "Переплетчик", "Печатник", "Редактор", "Типограф", "Фальцовщик", "HTML-верстальщик", "Web-интегратор", "Web-дизайнер", "Web-программист", "Администратор базы данных", "Администратор сайта", "Блогер", "Диктор", "Кодер", "Контент-менеджер", "Копирайтер", "Машинистка", "Оператор ПК", "Программист", "Радиоведущий", "Радист", "Системный администратор", "Телеграфист", "Тележурналист", "Тестировщик", "Акушер", "Андролог", "Анестезиолог", "Венеролог", "Вирусолог", "Врач скорой помощи", "Врач-диетолог", "Гинеколог", "Дерматовенеролог", "Дерматолог", "Диетолог", "Зубной техник", "Иммунолог", "Инфекционист", "Кардиолог", "Кардиохирург", "Косметолог", "Лаборант", "Логопед", "Мануалист", "Массажист", "Медицинская сестра", "Невролог", "Невропатолог", "Нейрохирург", "Нефролог", "Окулист", "Онколог", "Ортопед", "Оториноларинголог (ЛОР)", "Офтальмолог", "Педиатр", "Прозектор", "Проктолог", "Психиатр", "Психотерапевт", "Реабилитолог", "Реаниматолог", "Сексолог", "Спортивный врач", "Стоматолог", "Терапевт", "Токсиколог", "Травматолог", "Уролог", "Фармацевт", "Фельдшер", "Хирург", "Эндокринолог (специалист по гормонам)", "Археолог", "Архивариус", "Астроном", "Библиограф", "Биоинженер", "Биолог", "Биофизик", "Биохимик", "Ботаник", "Востоковед", "Генетик", "Генный инженер", "Гидролог", "Египтолог", "Зоолог", "Изобретатель", "Искусствовед", "Историк", "Ихтиолог", "Конструктор", "Культуролог", "Математик", "Метеоролог", "Микробиолог", "Нанотехнолог", "Орнитолог", "Палеонтолог", "Политолог", "Почвовед", "Религиовед", "Социолог", "Теолог", "Физик", "Философ", "Химик", "Эколог", "Этнограф", "Воспитатель", "Дефектолог", "Логопед", "Педагог", "Преподаватель", "Проректор", "Психолог", "Ректор", "Сурдопедагог", "Тифлопедагог", "Учитель", "Булочник", "Винодел", "Кондитер", "Месильщик", "Мясник", "Пекарь", "Повар", "Вышивальщица", "Гид-переводчик", "Дегустатор", "Кинолог", "Лингвист", "Переводчик", "Промышленный альпинист", "Реставратор", "Референт", "Священнослужитель", "Секретарь-референт", "Секретарь-стенографистка", "Дорожный инспектор", "Пожарный", "Агроном", "Ветеринар", "Доярка", "Животновод", "Комбайнер", "Оператор машинного доения", "Охотник", "Пастух", "Пчеловод", "Скотник", "Специалист по стрижке овец", "Тракторист", "Фермер", "Рыбак", "Агент по туризму", "Страховой агент", "Администратор гостиницы", "Администратор ресторана", "Администратор салона красоты", "Бармен", "Библиотекарь", "Визажист", "Грузчик", "Дворник", "Кладовщик", "Консультант по туризму", "Консультант телефона доверия", "Маникюрша", "Мусоропроводчик", "Мусорщик", "Настройщик музыкальных инструментов", "Оператор call-центра", "Официант", "Парикмахер", "Портье", "Почтальон", "Садовник", "Сапожник", "Уборщица", "Упаковщик", "Флорист", "Цветочница", "Шеф-повар", "Инструктор по видам спорта", "Спортивный тренер", "Спортсмен", "Актер", "Аниматор", "Артист цирка", "Архитектор", "Балетмейстер", "Диджей", "Дизайнер", "Дизайнер рекламы", "Дизайнер-модельер", "Дирижер", "Журналист", "Закройщик", "Звукооператор", "Звукорежиссер", "Иллюстратор", "Имиджмейкер", "Каскадер", "Кинодраматург", "Киномеханик", "Кинооператор", "Кинорежиссер", "Композитор", "Критик", "Ландшафтный дизайнер", "Манекенщица", "Модель", "Музыкант", "Мультипликатор", "Оператор кино и телевидения", "Писатель", "Портной", "Продюсер", "Режиссер", "Скульптор", "Спичрайтер", "Стилист", "Сценарист", "Танцор балета", "Татуировщик", "Технический писатель", "Фотограф", "Фотомодель", "Хореограф", "Художник", "Художник по костюму", "Ювелир", "Постановщик трюков", "Автогонщик", "Автомеханик", "Автослесарь", "Аппаратчик-оператор", "Архитектор-проектировщик", "Бондарь", "Бульдозерист", "Вальцовщик стана горячей прокатки", "Водолаз", "Геодезист", "Геолог", "Геоэколог", "Главный инженер", "Главный конструктор", "Главный технолог", "Горняк", "Драпировщик", "Инженер", "Инженер-конструктор", "Инженер-технолог", "Инженер-химик", "Испытатель", "Каменщик", "Картограф", "Крановщик", "Краснодеревщик", "Кровельщик", "Литейщик", "Маляр", "Маркшейдер", "Мастер", "Машинист", "Металлург", "Монтажник", "Моторист", "Наладчик", "Облицовщик", "Отделочник", "Плотник", "Производственный мастер", "Прораб", "Проходчик", "Радиомеханик", "Ремонтник", "Рихтовщик", "Сантехник", "Сварщик", "Слесарь", "Сталевар", "Станочник широкого профиля", "Столяр", "Строитель", "Техник по эксплуатации", "Технолог", "Токарь", "Фрезеровщик", "Химик-технолог", "Холодильщик", "Часовщик", "Шахтер", "Швея", "Шлифовщик", "Штукатур", "Электрик", "Электромонтажник", "Энергетик", "Авиадиспетчер", "Бортинженер", "Бортмеханик", "Бортпроводник", "Бригадир железнодорожного пути", "Водитель", "Воздухоплаватель", "Диспетчер", "Капитан судна", "Космонавт", "Курьер", "Летчик", "Лоцман", "Матрос", "Моряк", "Проводник", "Слесарь-механик", "Стрелочник", "Стюардесса", "Таксист", "Штурман", "Экспедитор", "Продакт-менеджер", "Администратор предприятия торговли", "Ассистент менеджера по продажам", "Аудитор", "Банкир", "Банковский кассир-операционист", "Бизнес-аналитик", "Бизнес-консультант", "Бизнес-тренер", "Билетный кассир", "Бренд-дизайнер", "Бренд-менеджер", "Брокер", "Бухгалтер", "Дистрибутор", "Заведующий складом", "Инкассатор", "Кассир", "Кризис-менеджер", "Лоббист", "Логист", "Маклер", "Маркетолог", "Медиа-байер", "Менеджер", "Менеджер по PR", "Менеджер по закупкам", "Менеджер по логистике", "Менеджер по персоналу", "Менеджер по продажам", "Менеджер по работе с клиентами", "Менеджер по рекламе", "Менеджер по туризму", "Менеджер торгового зала", "Мерчендайзер", "Налоговый инспектор", "Офис-менеджер", "Оценщик", "Продавец", "Продавец-консультант", "Промоутер", "Риелтор", "Сметчик", "Снабженец", "Специалист по ВЭД", "Статистик", "Страховой агент", "Супервайзер", "Товаровед", "Торговый представитель", "Трейдер", "Финансист", "Финансовый аналитик", "Экономист", "Военнослужащий", "Разведчик"];

$(".job").on("keyup", function() {
    $(".jobs").css("display", "block");
    var inputValue = $(".job").val().toLowerCase();
    var searchQuery = auto_layout_keyboard(inputValue);
    var arrJobs = jobs;
    var jobsList = [];
    for (var i = 0; i < arrJobs.length; i++) {
        arrJobs[i].toLowerCase().indexOf(searchQuery) !== -1;
        if (arrJobs[i].toLowerCase().indexOf(searchQuery) !== -1) {
            jobsList.push(arrJobs[i]);
        }
    }
    $(".jobs").empty();
    for (var i = 0; i < jobsList.length; i++) {
        $(".jobs").append("<li>" + jobsList[i] + "</li>");
    }
});

$("body").on("click", ".jobs li", function() {
    $(".job").val($(this).text());
    $(".jobs").css("display", "none");
})
$("body").click(function() {
    $(".jobs").css("display", "none");
})

// scroll
var scrollCounter = 0;
var oldScrollTop = 0;

$(document).scroll(function() {
    var currentScrollTop = $(document).scrollTop();
    var scrollDelta = currentScrollTop - oldScrollTop;
    if (scrollDelta >= 0) {
        scrollCounter++;
    }
    if (scrollCounter >= 10) {
        $(".logo").css("visibility", "visible");
    }
    if (scrollCounter >= 40) {
        $(".form input, .job-example, .city-example").css("visibility", "visible");
    }
    if (scrollCounter >= 60) {
        $(".button").css("visibility", "visible");
    }
    oldScrollTop = currentScrollTop;
});
